[
    {
    "id":1,        
    "jobtitle":"Undergraduate Researcher",
    "company": "Bazylak Group and Latner Thoracic Research Laboratories",
    "date": "May 2024 - Aug 2024",
    "description": "Optimized a MATLAB pipeline for extracting lung vasculature and airway geometry, achieving a 47% reduction in processing time using memory allocation techniques and MATLAB Profiler tools. Developed imaging methods producing micro-CT scans with over 1,000 airway branches (~30 generations) and constructed simplified airway geometries for CFD analysis using the Branch Builder tool.",
    "image": "./experiencePics/Latner.png",
    "skills": ["Micro-CT Imaging", "Python", "MATLAB", "Office Suite", "Public Speaking"]
    },
    {
    "id":2,
    "jobtitle":"UTAT AEAC Airframe Member",
    "company": "University of Toronto Aerospace Team",
    "date": "Jan 2024 - Present",
    "description": "Engaged in the design, fabrication, and testing of airframe components, including the shell, wings, and motor mount for drone in the Aerial Evolution Association of Canada UAS competition. Facilitated manufacturing of components using various techniques including 3D printing, carbon fiber, fiberglass, and epoxy resin to optimize weight and structural integrity.",
    "image": "./experiencePics/UTAT.png",
    "skills": ["SolidWorks", "Manufacturing", "Rapid Prototyping", "Teamwork"]
    },
    {
    "id":4,
    "jobtitle":"Production Support",
    "company": "Mitsubishi Heavy Industries",
    "date": "Jun 2022 - Aug 2022",
    "description": "Contributed to the production of Bombardier Global Express 5000 wings and center fuselage, ensuring compliance with quality standards. Performed tasks such as painting touchups, cleaning, sandblasting, and preparing wings for leak tests across multiple production stages, including spar shop, final inspection, and shipping preparation.",
    "image": "./experiencePics/MHI.jpg",
    "skills": ["Sand Blasting", "Pneumatic Tools", "Painting", "WHIMS Safety"]
    },
    {
    "id":5,
    "jobtitle":"Volunteer Judge",
    "company": "UofT Discovery Symposium",
    "date": "Jun 2024",
    "description": "As an Undergraduate Researcher participating in the Faculty of Applied Sciences and Engineering Undergraduate Summer Research Program (FASE USRP), I volunteered as a judge for the UofT Discovery Symposium where High School students presented posters about research they conducted in the UofT Discovery program.",
    "image": "./experiencePics/Discovery.png",
    "skills": ["Communication", "Professionalism", "Mentorship"]
    },

    {
    "id":3,
    "jobtitle":"Banquet Waiter",
    "company": "Roma's Hospitality Centre",
    "date": "Dec 2022 - Present",
    "description": "Supported event setup, cleanup, and food and beverage service to ensure smooth operations and a positive guest experience. Assisted attendees with concerns, provided prompt solutions, and communicating with colleagues to maintain high quality service.",
    "image": "./experiencePics/Romas.png",
    "skills": ["Teamwork", "Customer Service", "Communication"]
    } 
]