[
    
    

    {
        "id":2,
        "projectTitle": "CNC Router Design (MIE243)",
        "description": "Together with a team of four second year Mechanical Engineering students in MIE243 Mechanical Engineering Design, we researched and designed a DIY hobbyist CNC Router setup. This involved developing the engineering specifications, budgeting, researching components, drafting candidate designs, creating CAD parts and assemblies in SolidWorks and running static load simulations. The final conceptual design features a 2ft by 3ft bed with a belt drive system in the x and y axis as well as a lead screw setup in the z axis all ran by stepper motors. The design holds a 2.2kW spindle motor capable of cutting various materials including soft metals and aluminum.",
        "link": "",
        "picture": "./projectsPics/CNCRouter.jpg",
        "skills": ["SolidWorks", "Teamwork", "Communication"]
    },
    {
        "id":3,
        "projectTitle": "Basic Machining Course",
        "description": "To gain a greater understanding of design for manufacturing, I participated in a two day basic machining course at George Brown College affiliated with the University of Toronto Faculty of Engineering. In this course, I learned how to operate a mill, drill press and lathe by machining a miniature piston with a functional crank slider. The piston is capable of moving and can be powered with pressurized air.  ",
        "link": "",
        "picture": "./projectsPics/GeorgeBrown.jpg",
        "skills": ["Computed Tomography", "Python", "MATLAB", "Office Suite", "Public Speaking"]
    },
    {
        "id":4,
        "projectTitle": "3D Printed Gear Box",
        "description": "Along with two other second year Engineering students in my MIE243 Mechanical Engineering Design course, we designed and manufactured a simple Gear Box with a 90 degree input to output shaft angle and a 3:1 gear ratio. The design was built using SolidWorks and later 3D printed at the Myhal DigiFab Lab. The gear box was then tested in class to ensure it's structural integrity, functionality and ease of assembly under the the maximum torque of a hand drill. ",
        "link": "",
        "picture": "./projectsPics/GearBox.jpg",
        "skills": ["SolidWorks", "Teamwork", "3D Printing"]
    },
    {
        "id":5,
        "projectTitle": "Resume Roast Webpage",
        "description": "In an attempt to create a more fun and engaging way to improve resume writing, I along with two of my friends created the Resume Roast Webpage for our Ignition Hacks Hackathon submission. Resume Roast takes the user's resume, and uses AI to generate a track by Drake, which disses their resume in a personalized and playful manner to highlight its weaknesses. The user is then prompted by an AI Kendrick Lamar who will delivers constructive criticisms and offering actionable advice for improving their resume in the form of a rap song set to an iconic beat. The frontend for the webpage was built with React, Tailwind, and JavaScript. The backend used Node.js, Google AI Studio to generate lyrics, and Elevenlabs API to generate the Drake and Kendrick vocals.",
        "link": "https://github.com/Nick2858/IgnitionHacks_ResumeRoast",
        "picture": "./projectsPics/ResumeRoast.png",
        "skills": ["Gemini API", "ElevenLabs API", "React", "Teamwork", "JavaScript"]
    },
    {
        "id":6,
        "projectTitle": "Portfolio Webpage",
        "description": "As a Mechanical Engineering student with many hobbies and projects, as well as an avid coder; creating a portfolio webpage was the perfect opportunity for me to develop my programming skills, and showcase what I've been working on in a fun and personalized way. The webpage was built using react and vite. It was coded in TypeScript and features many different custom made components for different sections of the webpage. I also wanted to give users the opportunity to engage in my projects by including 3D models and videos where applicable.",
        "link": "https://github.com/Nick2858/Professional-Webpage",
        "picture": "./projectsPics/WebPage.png",
        "skills": ["React", "TypeScript", "UI Design","Three.js"]
    }



]